Repository: common-repository/current-password
Catalog: languages/current-password-*.po
Languages: es_es, fr_fr, hu_hu, ru_ru

source: Current Password
es_es: Contraseña actual
fr_fr: Mot de passe
hu_hu: Jelenlegi jelszó
ru_ru: Текущий пароль

source: Admin Password
es_es: Contraseña de administrador
fr_fr: Mot de passe administrateur
hu_hu: Adminisztrátori jelszó
ru_ru: Пароль администратора

source: To change password, please type your current password.
es_es: Para cambiar la contraseña, escribe tu contraseña actual.
fr_fr: Veuillez entrer votre mot de passe pour le modifier.
hu_hu: A jelszóváltoztatáshoz adja meg jelenlegi jelszavát.
ru_ru: Чтобы изменить пароль, введите ваш текущий пароль.

source: To change password, please type your admin password.
es_es: Para cambiar la contraseña, escribe tu contraseña de administrador.
fr_fr: Veuillez entrez votre mot de passe administrateur pour le modifier.
hu_hu: A jelszóváltoztatáshoz adja meg adminisztrátori jelszavát.
ru_ru: Чтобы изменить пароль, введите ваш администраторский пароль.

source: Type your admin password to create a new user.
es_es: Para crear un usuario nuevo, escribe tu contraseña de administrador.
fr_fr: Pour créer un nouvel utilisateur, entrez votre mot de passe administrateur.
hu_hu: Új felhasználó létrehozásához adja meg adminisztrátori jelszavát.
ru_ru: Введите ваш администраторский пароль, чтобы добавить новый аккаунт.

source: ERROR
fr_fr: ERREUR
hu_hu: HIBA
ru_ru: ОШИБКА

source: Please enter your current password.
es_es: Escribe tu contraseña actual.
fr_fr: Veuillez entrer votre mot de passe.
hu_hu: Kérjük, adja meg jelenlegi jelszavát.
ru_ru: Введите ваш текущий пароль.

source: Please enter your admin password.
es_es: Escribe tu contraseña de administrador.
fr_fr: Veuillez entrer votre mot de passe administrateur.
hu_hu: Kérjük, adja meg adminisztrátori jelszavát.
ru_ru: Введите ваш администраторский пароль.

source: The provided current password is invalid.
es_es: La contraseña actual introducida es incorrecta.
fr_fr: Le mot de passe indiqué n’est pas valide.
hu_hu: A megadott jelenlegi jelszó helytelen.
ru_ru: Введен неверный пароль.

source: The provided admin password is invalid.
es_es: La contraseña de administrador introducida es incorrecta.
fr_fr: Le mot de passe administrateur indiqué n’est pas valide.
hu_hu: A megadott adminisztrátori jelszó helytelen.
ru_ru: Введен неверный пароль администратора.

source: Type your current password.
es_es: Escribe tu contraseña actual.
fr_fr: Tapez votre mot de passe.
hu_hu: Adja meg jelenlegi jelszavát.
ru_ru: Введите ваш текущий пароль.
